package ir.loper.neginsabz.Data;


import java.util.ArrayList;

import ir.loper.neginsabz.Model.AmozeshModel;
import ir.loper.neginsabz.Model.MazayaModel;
import ir.loper.neginsabz.R;


public class Amozesh {

    ArrayList<AmozeshModel> data = new ArrayList<>();

    String[] title =new String[]{


            "دستور پخت خورشت بوقلمون",


            "دستور پخت کباب بوقلمون",


            "دستور پخت بوقلمون شکم پر",


            "دستور پخت باقالی پلو با گوشت بوقلمون",


            "دستور پخت خورشت فسنجان با گوشت بوقلمون"

    };

    String[] description =new String[]{


            " خورشت بوقلمون",


            "کباب بوقلمون",


            "بوقلمون شکم پر",


            "باقالی پلو با گوشت بوقلمون",


            "خورشت فسنجان با گوشت بوقلمون"

    };

    int[] image =new int[]{
            R.drawable.amozesh1,
            R.drawable.amozesh2,
            R.drawable.amozesh3,
            R.drawable.amozesh4,
            R.drawable.amozesh5
    };

    String[] text =new String[]{

            "مواد لازم :\n" +
                    "\n" +
                    "   گوشت بوقلمون: 300گرم\n" +
                    "\n" +
                    "    سیب\u200Cزمینی: 2 عدد\n" +
                    "\n" +
                    "    شوید خشك: 2 قاشق غذاخوری\n" +
                    "\n" +
                    "    پیاز خلال شده: 1 عدد\n" +
                    "\n" +
                    "    تخم آفتا\u200Cب\u200C گردان: 1 قاشق غذاخوری\n" +
                    "\n" +
                    "   روغن\u200C زیتون: 3 تا 4 قاشق غذاخوری\n" +
                    "\n" +
                    "   آب، نمك و زعفران: به میزان لازم\n" +
                    "\n" +
                    "طرز تهیه خورش بوقلمون :\n" +
                    "\n" +
                    " گوشت بوقلمون را به تكه\u200C های ریز قیمه\u200Cای درآورده و به مدت یك ساعت در پیاز و زعفران قرار داده و در یخچال بگذارید.\n" +
                    "\n" +
                    " سپس گوشت\u200Cها را به همراه پیاز و روغن\u200Cزیتون روی حرارت ملایم بگذارید و تفت دهید، بعد دو لیوان آب به مواد اضافه كنید و بگذارید به مدت 45 دقیقه بپزد تا گوشت نرم شود.\n" +
                    "\n" +
                    " آن\u200Cگاه سیب\u200Cزمینی\u200C و تخم آفتابگردان را اضافه \u200Cكنید.\n" +
                    "\n" +
                    " وقتی گوشت و سیب\u200C زمینی پخت و آب خورش غلیظ شد، در ظرف موردنظر بكشید و در صورت دلخواه یك قاشق روغن\u200Cزیتون روی آن بریزید.",




            "گوشت بوقلمون از پرمصرف ترین و پر خاصیت ترین گوشتهاست چرا که هم دارای گوشت سفید و هم دارای گوشت قرمزه ! علاوه بر این حجم بیشتر گوشت در مقابل استخوانهای کمتر ، باعث ترجیح دادن اون بجای گوشت گاو شده ! در این آموزش میخوایم طرز تهیه نوعی کباب با گوشت بوقلمون رو به شما معرفی کنیم که امیدواریم از این آموزش خوشتون بیاد و اون رو در خونه خودتون تهیه کنید و لذت ببرید .\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "مواد مورد نیاز برای 4 نفر\n" +
                    "\n" +
                    "کعب ران بوقلمون : 500 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "گشنیز تازه با ساقه : 20 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "نعنای تازه با ساقه : 20 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "زنجبیل تازه (خردشده) : 2.5 سانتیمتر\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "سیر : 6-8 حبه\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "زیره (آسیاب\u200Cشده) : 1 قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "تخم گشنیز (آسیاب\u200Cشده) : 1 قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "چیلی سبز تازه : بزرگ 1 عدد\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "چیلی قرمز (آسیاب\u200Cشده) : ½ قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "آبلیمو : 1 قاشق غذاخوری\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "نمک : به میزان دلخواه\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "روش پخت\n" +
                    "\n" +
                    "گوشت بوقلمون رو خوب تمیز کنید و تمامی تار و پود اون رو جدا کنید. البته چربی هاش رو دور نریزید. گوشت بوقلمون رو به همراه گشنیز، نعنا، زنجبیل، سیر و چیلی سبز چرخ کنید.\n" +
                    "\n" +
                    "بعد از چرخ کردن، پودر زیره، تخم گشنیز، چیلی قرمز، آبلیمو و نمک رو بهش اضافه کنید و به خوبی مخلوطش کنید.در اون رو ببندید و بزارید داخل یخچال تا سرد بشه. \n" +
                    "\n" +
                    "به اندازه یک گلوله 5سانتی از مخلوط گوشت چرخ\u200Cکرده بردارید و با دست اون رو به خوبی ورز بدید. گلوله گوشت رو روی وسط سیخ مخصوص کباب کوبیده بزارید و دورتا دور سیخ رو بپوشونید. حتما یادتون باشه که از سیخ مخصوص کباب کوبیده استفاده کنید.\n" +
                    "\n" +
                    "دستتون رو کمی با روغن یا آب آغشته کنید و روی گوشت بمالید و اون رو به شکل سوسیس با قطر 2.5 سانت دربیارید. به همین شکل باقی مخلوط گوشت را به سیخ بکشید. سیخ\u200Cهای گوشت رو روی منقل که از قبل روشن کرید، کباب کنید. حتما هم حواستون باشه که بیش از اندازه کباب\u200Cها رو نپزید.\n" +
                    "\n" +
                    "بعد از چند دقیقه پختن روی آتیش، کباب خوشمزه بوقلمون ما آماده سرو کردن و میل کردن هست و میتونید ازش لذت ببرید.\n" +
                    "\n" +
                    "امیدواریم که از تهیه و نوش جان کردن این کباب خوشمزه لذت کافی رو ببرید.",




            "مواد لازم برای تهیه بوقلمون شکم پر برای ۴ نفر\n" +
                    "\n" +
                    "بوقلمون پاک کرده : ۱ عدد\n" +
                    "کره آب شده : ۱ پیمانه\n" +
                    "زعفران : به میزان لازم\n" +
                    "نمک و فلفل : به میزان لازم\n" +
                    "آویشن : به میزان لازم\n" +
                    "مواد لازم برای داخل شکم بوقلمون\n" +
                    "\n" +
                    "رب انار : ۱ قاشق غذاخوری\n" +
                    "انار تازه : ۴ عدد\n" +
                    "پیاز داغ : ۱ پیمانه\n" +
                    "گردو : ۱ پیمانه\n" +
                    "کرفس خرد شده : ۱ پیمانه\n" +
                    "کشمش : ۱/۲ پیمانه\n" +
                    "شکر : ۱/۴ پیمانه\n" +
                    "کره : ۱ پیمانه\n" +
                    "جعفری : ۱/۴ پیمانه\n" +
                    "طرز تهیه بوقلمون شکم پر با سس انار\n" +
                    "\n" +
                    "ابتدا فر را بر روی درجه حرارت ۲۰۰ درجه تنظیم کنید تا به خوبی داغ شود سپس داخل شکم بوقلمون را به خوبی تمیز کنید و بشویید و بوقلمون را خشک کنید. در مرحله بعدی طرز تهیه بوقلمون گردو ها را بر روی حرارت ملایمی قرار دهید تا کمی تفت بخورند سپس کره را به گردوها اضافه کنید و بعد از اینکه کره ذوب شد جعفری و کرفس و رب انار و دانه انار و کشمش و پیاز داغ و شکر را به گردو ها اضافه کنید و اجازه دهید تا مواد مخلوط شده به مدت ۵ دقیقه دیگر نیز بر روی حرارت ملایم باقی بمانند تا به خوبی با یکدیگر ادغام شوند.\n" +
                    "\n" +
                    " بعد از اینکه مواد به خوبی تفت خوردند داخل شکم بوقلمون را با کمک این مواد پر کنید و روی بوقلمون کره آب شده بمالید سپس نمک و فلفل و پودر آویشن و زعفران را باهم مخلوط کنید و با کمک برس مخلوط این مواد را کاملا بر رو و زیر بوقلمون بزنید ( توجه داشته باشید که اینکار را باید هر ۳۰ دقیقه انجام دهید پس بهتر است همه این مواد را به صورت یک جا بر روی بوقلمون نمالید)." +
                    "در مرحله بعدی دستور پخت بوقلمون سینی بزرگی که دیواره های بلندتری دارد را انتخاب کنید و بوقلمون را درون سینی فر قرار دهید سپس سینی فر را به مدت ۸ ساعت درون فر بگذارید بعد از مدت زمان ذکر شده بوقلمون را از فر بیرون آورید و با خود آب بوقلمون آن را سرو کنید.\n" +
                    "\n" +
                    " برای تهیه بوقلمون بهتر است از صبح شروع کنید تا زمان لازم را برای پخت داشته باشید زیرا گوشت بوقلمون دیرپز است و برای داشتن بوقلمونی لذیذ و لطیف باید حداقل ۸ ساعت زمان پخت را در نظر بگیرید. بوقلمون شکم پر را می توانید در وعده نهار و شام سرو کنید." +
                    "" +
                    "در مرحله بعدی دستور پخت بوقلمون سینی بزرگی که دیواره های بلندتری دارد را انتخاب کنید و بوقلمون را درون سینی فر قرار دهید سپس سینی فر را به مدت ۸ ساعت درون فر بگذارید بعد از مدت زمان ذکر شده بوقلمون را از فر بیرون آورید و با خود آب بوقلمون آن را سرو کنید.\n" +
                    "\n" +
                    " برای تهیه بوقلمون بهتر است از صبح شروع کنید تا زمان لازم را برای پخت داشته باشید زیرا گوشت بوقلمون دیرپز است و برای داشتن بوقلمونی لذیذ و لطیف باید حداقل ۸ ساعت زمان پخت را در نظر بگیرید. بوقلمون شکم پر را می توانید در وعده نهار و شام سرو کنید.",




            "گوشت بوقلمون تکه شده (سینه یا ران):  400 گرم \n" +
                    "باقالی پخته شده:  به میزان لازم \n" +
                    "برنج آبکش شده: 4 پیمانه \n" +
                    "شوید:  به میزان لازم \n" +
                    "پیاز نگین شده:  2 عدد متوسط\n" +
                    "نمک / زرچوبه / ادویه مخصوص بوقلمون:  به میزان لازم \n" +
                    " زعفران:  1 قاشق غذا خوری\n" +
                    "\n" +
                    "طرز تهیه باقلا پلو با گوشت بوقلمون :\n" +
                    "\n" +
                    "در ابتدا پیاز را کمی تفت داده و بعد گوشت را اضافه می کنیم و آن را تفت داده و بعد کمی نمک، زرچوبه و ادویه مخصوص بوقلمون را اضافه می کنیم و مجددا تفت می دهیم و بعد حدود یک لیوان آب اضافه می کنیم و به مدت نیم ساعت می گداریم که گوشت پخته شود بر روی حرارت ملایم و می گذاریم تا آب گوشت تبخیر شود. بعد از پخته شدن گوشت برنج را آماده می کنیم و مقداری روغن در ظرف غذا ریخته در صورت تمایل می توانیم که ته ظرف را سیب زمینی یا هر چه که دوست داشته باشیم بذاریم و بعد مقداری از برنج آبکش شده را ریخته و بعد مقداری از باقالی پخته شده و مقداری شوید و مجددا روی آن را برنج ریخته و به مدت 60 دقیقه روی شعله کم می گذاریم تا غذا آماده شود (می توان گوشت پخته شده را بین برنج هنگام دم آمدن هم گذاشت)",




            "مواد لازم:\n" +
                    "\n" +
                    "۱- گوشت بوقلمون نیم کیلو\n" +
                    "\n" +
                    "۲- مغز گردو چرخ شده نیم کیلو\n" +
                    "\n" +
                    "۳- رب انار 4 تا 5 قاشق سوپخوری \n" +
                    "\n" +
                    "۴-نمک و زردچوبه و دارچین به میزان لازم\n" +
                    "\n" +
                    "۵- رب گوجه فرنگی: یک قاشق غذا خوری\n" +
                    "\n" +
                    "در ابتدا گردو رو با مقداری آب حدود نیم ساعت بگذارید که بپزد. سپس رب انار را به آن اضافه کنید.\u200C\u200C\u200C\u200C\u200C\u200C\u200C.هر زمان که آب آن کم شده حتما اب سرد به ان اضافه کنید و سعی کنید از تکه های یخ استفاده کنید تا روغن بیاندازد...یخ باعث می شود که به غذا شوک وارد شود و روغن بیشتری بیاندازد. بهتر است از قبل بوقلمون را با پیاز و ۳ ۴ لیوان اب بپزید....بعد از اینکه خورشت تقریبا جا افتاد گوشت بوقلمون را به ان اضافه کنید و روی حرارت ملابم بگذارید تا خورشت کاملا جا بیافتد. سپس برای خوشرنگ شدن در صورت دلخواه رب گوجه را به آن اضافه کنید....بعد از آن همراه با پلو و مخلفات دلخواه سرو کنید.\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "\n" +
                    "گوشت سینه بوقلمون را با پیاز و 3 تا 4 لیوان آب و گردووکمی نمک در ظرف مناسبی ریخته روی حرارت ملایم میگذاریم رب انار را نیم ساعت اواخر پخت اضافه می کنیم و اجازه می دهیم تا کاملا جابیفتد."





    };


    public Amozesh() {
        setData();
    }

    private void setData() {

        for (int i = 0; i < title.length; i++) {
            AmozeshModel model = new AmozeshModel();
            model.setTitle(title[i]);
            model.setDescription(description[i]);
            model.setImage(image[i]);
            model.setText1(text[i]);
            data.add(model);
        }
    }

    public ArrayList<AmozeshModel> getData(){
        return data;
    }

}
