package ir.loper.neginsabz.Data;


import java.util.ArrayList;

import ir.loper.neginsabz.Model.AmozeshModel;
import ir.loper.neginsabz.R;


public class Amozesh {

    ArrayList<AmozeshModel> data = new ArrayList<>();

    String[] title =new String[]{


            "دستور پخت خورشت بوقلمون",

            "دستور پخت کباب بوقلمون",

            "دستور پخت بوقلمون شکم پر",

            "دستور پخت باقالی پلو با گوشت بوقلمون",

            "دستور پخت خورشت فسنجان با گوشت بوقلمون",

            "دستور پخت بوقلمون سرخ شده فرانسوی",

            "دستور پخت کوفته بوقلمون و پیازچه",

            "دستور پخت خورشت قیمه با گوشت بوقلمون",

            "دستور پخت کباب تابه ای بوقلمون",

            "دستور پخت ساندویچ بوقلمون با سس پنیر",

            "دستور پخت تاس کباب"

    };

    String[] description =new String[]{


            " خورشت بوقلمون",

            "کباب بوقلمون",

            "بوقلمون شکم پر",

            "باقالی پلو با گوشت بوقلمون",

            "خورشت فسنجان با گوشت بوقلمون",

            "بوقلمون سرخ شده فرانسوی",

            "کوفته بوقلمون و پیازچه",

            "خورشت قیمه با گوشت بوقلمون",

            "کباب تابه ای بوقلمون",

            "ساندویچ بوقلمون با سس پنیر",

            "تاس کباب"



    };

    int[] image =new int[]{
            R.drawable.amozesh1,
            R.drawable.amozesh2,
            R.drawable.amozesh3,
            R.drawable.amozesh4,
            R.drawable.amozesh5,
            R.drawable.amozesh6,
            R.drawable.amozesh7,
            R.drawable.amozesh8,
            R.drawable.amozesh9,
            R.drawable.amozesh10,
            R.drawable.amozesh11
    };

    String[] text =new String[]{

            "مواد لازم :\n" +
                    "\n" +
                    "   گوشت بوقلمون: 300گرم\n" +
                    "\n" +
                    "    سیب\u200Cزمینی: 2 عدد\n" +
                    "\n" +
                    "    شوید خشك: 2 قاشق غذاخوری\n" +
                    "\n" +
                    "    پیاز خلال شده: 1 عدد\n" +
                    "\n" +
                    "    تخم آفتا\u200Cب\u200C گردان: 1 قاشق غذاخوری\n" +
                    "\n" +
                    "   روغن\u200C زیتون: 3 تا 4 قاشق غذاخوری\n" +
                    "\n" +
                    "   آب، نمك و زعفران: به میزان لازم\n" +
                    "\n" +
                    "طرز تهیه خورش بوقلمون :\n" +
                    "\n" +
                    " گوشت بوقلمون را به تكه\u200C های ریز قیمه\u200Cای درآورده و به مدت یك ساعت در پیاز و زعفران قرار داده و در یخچال بگذارید.\n" +
                    "\n" +
                    " سپس گوشت\u200Cها را به همراه پیاز و روغن\u200Cزیتون روی حرارت ملایم بگذارید و تفت دهید، بعد دو لیوان آب به مواد اضافه كنید و بگذارید به مدت 45 دقیقه بپزد تا گوشت نرم شود.\n" +
                    "\n" +
                    " آن\u200Cگاه سیب\u200Cزمینی\u200C و تخم آفتابگردان را اضافه \u200Cكنید.\n" +
                    "\n" +
                    " وقتی گوشت و سیب\u200C زمینی پخت و آب خورش غلیظ شد، در ظرف موردنظر بكشید و در صورت دلخواه یك قاشق روغن\u200Cزیتون روی آن بریزید.",




            "گوشت بوقلمون از پرمصرف ترین و پر خاصیت ترین گوشتهاست چرا که هم دارای گوشت سفید و هم دارای گوشت قرمزه ! علاوه بر این حجم بیشتر گوشت در مقابل استخوانهای کمتر ، باعث ترجیح دادن اون بجای گوشت گاو شده ! در این آموزش میخوایم طرز تهیه نوعی کباب با گوشت بوقلمون رو به شما معرفی کنیم که امیدواریم از این آموزش خوشتون بیاد و اون رو در خونه خودتون تهیه کنید و لذت ببرید .\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "مواد مورد نیاز برای 4 نفر\n" +
                    "\n" +
                    "کعب ران بوقلمون : 500 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "گشنیز تازه با ساقه : 20 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "نعنای تازه با ساقه : 20 گرم\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "زنجبیل تازه (خردشده) : 2.5 سانتیمتر\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "سیر : 6-8 حبه\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "زیره (آسیاب\u200Cشده) : 1 قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "تخم گشنیز (آسیاب\u200Cشده) : 1 قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "چیلی سبز تازه : بزرگ 1 عدد\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "چیلی قرمز (آسیاب\u200Cشده) : ½ قاشق غذاخوری\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "آبلیمو : 1 قاشق غذاخوری\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "نمک : به میزان دلخواه\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "روش پخت\n" +
                    "\n" +
                    "گوشت بوقلمون رو خوب تمیز کنید و تمامی تار و پود اون رو جدا کنید. البته چربی هاش رو دور نریزید. گوشت بوقلمون رو به همراه گشنیز، نعنا، زنجبیل، سیر و چیلی سبز چرخ کنید.\n" +
                    "\n" +
                    "بعد از چرخ کردن، پودر زیره، تخم گشنیز، چیلی قرمز، آبلیمو و نمک رو بهش اضافه کنید و به خوبی مخلوطش کنید.در اون رو ببندید و بزارید داخل یخچال تا سرد بشه. \n" +
                    "\n" +
                    "به اندازه یک گلوله 5سانتی از مخلوط گوشت چرخ\u200Cکرده بردارید و با دست اون رو به خوبی ورز بدید. گلوله گوشت رو روی وسط سیخ مخصوص کباب کوبیده بزارید و دورتا دور سیخ رو بپوشونید. حتما یادتون باشه که از سیخ مخصوص کباب کوبیده استفاده کنید.\n" +
                    "\n" +
                    "دستتون رو کمی با روغن یا آب آغشته کنید و روی گوشت بمالید و اون رو به شکل سوسیس با قطر 2.5 سانت دربیارید. به همین شکل باقی مخلوط گوشت را به سیخ بکشید. سیخ\u200Cهای گوشت رو روی منقل که از قبل روشن کرید، کباب کنید. حتما هم حواستون باشه که بیش از اندازه کباب\u200Cها رو نپزید.\n" +
                    "\n" +
                    "بعد از چند دقیقه پختن روی آتیش، کباب خوشمزه بوقلمون ما آماده سرو کردن و میل کردن هست و میتونید ازش لذت ببرید.\n" +
                    "\n" +
                    "امیدواریم که از تهیه و نوش جان کردن این کباب خوشمزه لذت کافی رو ببرید.",




            "مواد لازم برای تهیه بوقلمون شکم پر برای ۴ نفر\n" +
                    "\n" +
                    "بوقلمون پاک کرده : ۱ عدد\n" +
                    "کره آب شده : ۱ پیمانه\n" +
                    "زعفران : به میزان لازم\n" +
                    "نمک و فلفل : به میزان لازم\n" +
                    "آویشن : به میزان لازم\n" +
                    "مواد لازم برای داخل شکم بوقلمون\n" +
                    "\n" +
                    "رب انار : ۱ قاشق غذاخوری\n" +
                    "انار تازه : ۴ عدد\n" +
                    "پیاز داغ : ۱ پیمانه\n" +
                    "گردو : ۱ پیمانه\n" +
                    "کرفس خرد شده : ۱ پیمانه\n" +
                    "کشمش : ۱/۲ پیمانه\n" +
                    "شکر : ۱/۴ پیمانه\n" +
                    "کره : ۱ پیمانه\n" +
                    "جعفری : ۱/۴ پیمانه\n" +
                    "طرز تهیه بوقلمون شکم پر با سس انار\n" +
                    "\n" +
                    "ابتدا فر را بر روی درجه حرارت ۲۰۰ درجه تنظیم کنید تا به خوبی داغ شود سپس داخل شکم بوقلمون را به خوبی تمیز کنید و بشویید و بوقلمون را خشک کنید. در مرحله بعدی طرز تهیه بوقلمون گردو ها را بر روی حرارت ملایمی قرار دهید تا کمی تفت بخورند سپس کره را به گردوها اضافه کنید و بعد از اینکه کره ذوب شد جعفری و کرفس و رب انار و دانه انار و کشمش و پیاز داغ و شکر را به گردو ها اضافه کنید و اجازه دهید تا مواد مخلوط شده به مدت ۵ دقیقه دیگر نیز بر روی حرارت ملایم باقی بمانند تا به خوبی با یکدیگر ادغام شوند.\n" +
                    "\n" +
                    " بعد از اینکه مواد به خوبی تفت خوردند داخل شکم بوقلمون را با کمک این مواد پر کنید و روی بوقلمون کره آب شده بمالید سپس نمک و فلفل و پودر آویشن و زعفران را باهم مخلوط کنید و با کمک برس مخلوط این مواد را کاملا بر رو و زیر بوقلمون بزنید ( توجه داشته باشید که اینکار را باید هر ۳۰ دقیقه انجام دهید پس بهتر است همه این مواد را به صورت یک جا بر روی بوقلمون نمالید)." +
                    "در مرحله بعدی دستور پخت بوقلمون سینی بزرگی که دیواره های بلندتری دارد را انتخاب کنید و بوقلمون را درون سینی فر قرار دهید سپس سینی فر را به مدت ۸ ساعت درون فر بگذارید بعد از مدت زمان ذکر شده بوقلمون را از فر بیرون آورید و با خود آب بوقلمون آن را سرو کنید.\n" +
                    "\n" +
                    " برای تهیه بوقلمون بهتر است از صبح شروع کنید تا زمان لازم را برای پخت داشته باشید زیرا گوشت بوقلمون دیرپز است و برای داشتن بوقلمونی لذیذ و لطیف باید حداقل ۸ ساعت زمان پخت را در نظر بگیرید. بوقلمون شکم پر را می توانید در وعده نهار و شام سرو کنید." +
                    "" +
                    "در مرحله بعدی دستور پخت بوقلمون سینی بزرگی که دیواره های بلندتری دارد را انتخاب کنید و بوقلمون را درون سینی فر قرار دهید سپس سینی فر را به مدت ۸ ساعت درون فر بگذارید بعد از مدت زمان ذکر شده بوقلمون را از فر بیرون آورید و با خود آب بوقلمون آن را سرو کنید.\n" +
                    "\n" +
                    " برای تهیه بوقلمون بهتر است از صبح شروع کنید تا زمان لازم را برای پخت داشته باشید زیرا گوشت بوقلمون دیرپز است و برای داشتن بوقلمونی لذیذ و لطیف باید حداقل ۸ ساعت زمان پخت را در نظر بگیرید. بوقلمون شکم پر را می توانید در وعده نهار و شام سرو کنید.",




            "گوشت بوقلمون تکه شده (سینه یا ران):  400 گرم \n" +
                    "باقالی پخته شده:  به میزان لازم \n" +
                    "برنج آبکش شده: 4 پیمانه \n" +
                    "شوید:  به میزان لازم \n" +
                    "پیاز نگین شده:  2 عدد متوسط\n" +
                    "نمک / زرچوبه / ادویه مخصوص بوقلمون:  به میزان لازم \n" +
                    " زعفران:  1 قاشق غذا خوری\n" +
                    "\n" +
                    "طرز تهیه باقلا پلو با گوشت بوقلمون :\n" +
                    "\n" +
                    "در ابتدا پیاز را کمی تفت داده و بعد گوشت را اضافه می کنیم و آن را تفت داده و بعد کمی نمک، زرچوبه و ادویه مخصوص بوقلمون را اضافه می کنیم و مجددا تفت می دهیم و بعد حدود یک لیوان آب اضافه می کنیم و به مدت نیم ساعت می گداریم که گوشت پخته شود بر روی حرارت ملایم و می گذاریم تا آب گوشت تبخیر شود. بعد از پخته شدن گوشت برنج را آماده می کنیم و مقداری روغن در ظرف غذا ریخته در صورت تمایل می توانیم که ته ظرف را سیب زمینی یا هر چه که دوست داشته باشیم بذاریم و بعد مقداری از برنج آبکش شده را ریخته و بعد مقداری از باقالی پخته شده و مقداری شوید و مجددا روی آن را برنج ریخته و به مدت 60 دقیقه روی شعله کم می گذاریم تا غذا آماده شود (می توان گوشت پخته شده را بین برنج هنگام دم آمدن هم گذاشت)",




            "مواد لازم:\n" +
                    "\n" +
                    "۱- گوشت بوقلمون نیم کیلو\n" +
                    "\n" +
                    "۲- مغز گردو چرخ شده نیم کیلو\n" +
                    "\n" +
                    "۳- رب انار 4 تا 5 قاشق سوپخوری \n" +
                    "\n" +
                    "۴-نمک و زردچوبه و دارچین به میزان لازم\n" +
                    "\n" +
                    "۵- رب گوجه فرنگی: یک قاشق غذا خوری\n" +
                    "\n" +
                    "در ابتدا گردو رو با مقداری آب حدود نیم ساعت بگذارید که بپزد. سپس رب انار را به آن اضافه کنید.\u200C\u200C\u200C\u200C\u200C\u200C\u200C.هر زمان که آب آن کم شده حتما اب سرد به ان اضافه کنید و سعی کنید از تکه های یخ استفاده کنید تا روغن بیاندازد...یخ باعث می شود که به غذا شوک وارد شود و روغن بیشتری بیاندازد. بهتر است از قبل بوقلمون را با پیاز و ۳ ۴ لیوان اب بپزید....بعد از اینکه خورشت تقریبا جا افتاد گوشت بوقلمون را به ان اضافه کنید و روی حرارت ملابم بگذارید تا خورشت کاملا جا بیافتد. سپس برای خوشرنگ شدن در صورت دلخواه رب گوجه را به آن اضافه کنید....بعد از آن همراه با پلو و مخلفات دلخواه سرو کنید.\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "\n" +
                    "گوشت سینه بوقلمون را با پیاز و 3 تا 4 لیوان آب و گردووکمی نمک در ظرف مناسبی ریخته روی حرارت ملایم میگذاریم رب انار را نیم ساعت اواخر پخت اضافه می کنیم و اجازه می دهیم تا کاملا جابیفتد.",




            "این غذا با گوشت سینه بوقلمون پخته می\u200Cشود که آن را با قارچ مخلوط می\u200Cکنند و کافی است یک سس خوشمزه روی آن بریزید و خوبی مزه\u200Cاش را چند برابر کنید.\n" +
                    "بوقلمون\u200C را این\u200Cبار ورقه ورقه کرده و همراه با قارچ به شیوه فرانسوی سرخ\u200C و با سس پرتقال نوش جان کنید.\n" +
                    "زمان آماده سازی : کمتر از 15 دقیقه\n" +
                    "گوشت بوقلمون با سس پرتقال غذایی خوشمزه و آسان که تهیه آن تنها 18 دقیقه زمان می\u200Cبرد.\n" +
                    "مواد لازم بوقلمون سرخ\u200Cشده فرانسوی:\n" +
                    "گوشت سینه بوقلمون : 400 گرم\n" +
                    "قارچ : ¾ پیمانه\n" +
                    "آب پرتقال : ½ پیمانه\n" +
                    "پیاز کوچک : 1 عدد\n" +
                    "جعفری خرد شده : 2 قاشق غذاخوری\n" +
                    "روغن زیتون : 2 قاشق غذاخوری\n" +
                    "شکر : 1 قاشق چای\u200Cخوری\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "بوقلمون و قارچ را ورقه\u200Cورقه کنید.\n" +
                    "روغن را در یک تابه بزرگ گرم کنید. پیاز خردشده را اضافه کنید و به مدت 1 دقیقه روی شعله زیاد آن را تفت دهید.\n" +
                    "برش\u200Cهای بوقلمون را اضافه کنید و به مدت 2 الی 4 دقیقه یا تا زمانی\u200Cکه گوشت\u200Cهای بوقلمون قهوه\u200Cای شوند آنها را روی شعله زیاد تفت دهید.فراموش نکنید که دائم مواد درون تابه را هم بزنید.\n" +
                    "شعله گاز را کمتر کنید و قارچ\u200Cها اضافه کرده و آنها را به مدت 1 دقیقه تفت دهید.\n" +
                    "آب پرتقال و شکر را اضافه کنید پس از اینکه جوشید به مدت 1 دقیقه تکه\u200Cهای بوقلمون را در سس جابه\u200Cجا کنید تا طعم سس را به خود جذب کند.\n" +
                    "جعفری را اضافه کنید و غذا را سرو نمایید.\n",




            "یا گوشت بوقلمون چرخ کرده می\u200Cتوانید غذایی شبیه کوفته تبریزی بپزید و از آن لذت ببرید.\n" +
                    "این کوفته های خوشمزه بوقلمون و پیازچه، یک غذای مفید و مغذی با کالریِ کم برای بارداران است.\n" +
                    "مناسب برای :4 نفر\n" +
                    "زمان آماده سازی : بیش از 1 ساعت\n" +
                    "بارداران عزیز می\u200Cتوانید این غذا را با نودل به عنوانِ یک وعده غذاییِ کامل سرو کنید.\n" +
                    "\n" +
                    "مواد لازم کوفته بوقلمون و پیازچه:\n" +
                    "گوشتِ چرخ شده بوقلمون : نیم کیلوگرم\n" +
                    "تخم مرغ زده شده : 1 عدد\n" +
                    "روغن کنجد : 1 قاشق\n" +
                    "پیازچه تازه خرد شده : 1 قاشقِ غذاخوری\n" +
                    "آردِ ذرت : 2 قاشقِ غذاخوری\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "در یک کاسه محتویات را به خوبی با هم مخلوط کنید و حداقل به مدتِ 1 ساعت تا 1 روز در یخچال بگذارید.\n" +
                    "فر را در دمایِ 205 درجه سانتی گراد از قبل گرم کنید و با یک ورقه آلومنیومی رویِ سینیِ فر را بپوشانید. سپس دست\u200Cتان را خیس کنید و با مخلوط 16 توپِ 4 سانتیمتری درست کنید.\n" +
                    "کوفته\u200Cها را به مدتِ 10 دقیقه در فِر بپزید.\n" +
                    "سپس کباب پز یا ماهیتابه\u200Cای را گرم کنید و آن\u200Cها را به مدتِ 5 دقیقه گریل کنید تا قهوه\u200Cای شوند.\n",






            "مواد مورد نیاز برای 6 نفر\n" +
                    " ران بوقلمون (خردشده خورشی) 500 گرم\n" +
                    " زردچوبه : به میزان لازم\n" +
                    "لپه (خیس\u200Cشده):  1.5 پیمانه\n" +
                    "پیاز (ریزخردشده): 2 عدد\n" +
                    "لیمو امانی: 3 عدد\n" +
                    " رب گوجه\u200Cفرنگی : 2 قاشق غذاخوری\n" +
                    "نمک و فلفل : به میزان لازم\n" +
                    "دارچین : به میزان لازم\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "  در یک قابلمه، پیاز را در روغن با حرارت کم تفت دهید تا به خوبی طلایی شود.\n" +
                    "    زردچوبه را به آن اضافه کنید و کمی تفت دهید.\n" +
                    "گوشت بوقلمون را به آن اضافه کنید و به مدت 10دقیقه در ظرف را ببندید و تفت دهید تا رنگ آن عوض شود.\n" +
                    "  لپه را به آن اضافه کنید و تفت دهید. مراقب باشید که لپه\u200Cها نسوزد.\n" +
                    " رب گوجه\u200Cفرنگی را به مواد اضافه کنید و 3-4 دقیقه هم بزنید و تفت دهید.\n" +
                    " نمک، فلفل، دارچین، لیمو اَمانی و 2لیوان آب داغ به آن اضافه کنید و بگذارید به جوش آید.\n" +
                    "حرارت را کم کنید و بگذارید به مدت 35-40 دقیقه بپزد تا گوشت کاملا پخته شوده و خورش جا بیفتد.\n" +
                    " این خورش را می\u200Cتوانید به همراه سیب\u200Cزمینی سرخ\u200Cکرده یا بادمجان سرخ\u200Cشده (قیمه بادمجان)  سرو نمایید.\n" +
                    "در صورتی که بخواهید به صورت قیمه بادمجان تهیه نمایید، بهتر است 10-15 دقیقه آخر پخت خورش، بادمجان\u200Cهای سرخ\u200Cشده را به آن اضافه کنید و بگذارید طعم و مزه خورش را به خود بگیرد.\n",








            "مواد لازم:\n" +
                    "گوشت بوقلمون \uD83E\uDD83 500 گرم\n" +
                    "پیاز  1 عدد\n" +
                    "آرد  1 قاشق غذاخوری\n" +
                    "جعفری 50گرم\n" +
                    "نمک و فلفل به میزان لازم\n" +
                    "زردچوبه به میزان لازم\n" +
                    "روغن 3  قاشق سوپ خوری \n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "گوشت سینه بوقلمون را چرخ کرده و پیاز را روی آن ریز رنده کنید .سپس آرد را اضافه کرده ، نمک و فلفل و زرچوبه را بیفزایید.جعفری را ساطوری کرده به آن اضافه کنید و با دست مخلوط کنید . به اندازه گردی کمی بزرگتر از گردو از مخلوط جدا کرده و روی کف دست باز کنیدتابه را از قبل گرم کرده کمی روغن بریزید و کباب ها را در آن بچینید . دو طرف را کمی سرخ کنید .می توانید از سبزیجات پخته کنار ظرفتان استفاده کنید . نوش جان\n",



            "اضافه کردن پنبر به هر غذایی جذابیت و طعم فوق\u200Cالعاده\u200Cای به آن می دهد. این بار گوشت بوقلمون را یا طعم پنیر امتحان کنید.\n" +
                    "در این صورت یک ساندویچ متنوع خواهید داشت که شما را به خوردن دعوت می کند.\n" +
                    "نان تست پوشیده شده با گوشت بوقلمون و سس پنیر؛ دیگر حرفی برای گفتن باقی نمی\u200Cگذارد.\n" +
                    "مناسب برای :4 نفر\n" +
                    "زمان آماده سازی : کمتر از 1 ساعت\n" +
                    "نان تست پوشیده شده با گوشت بوقلمون و سس پنیر؛ دیگر حرفی برای گفتن باقی نمی\u200Cگذارد.\n" +
                    "در دستور اصلی این غذا از پنیر Muenster یا پنیر Monterey Jack استفاده شده است که در این جا می\u200Cتوان با پنیر پارمزان جایگزین کرد.\n" +
                    "\n" +
                    "میزان مواد غذایی در هر ساندویچ عبارتند از: 524 کالری، 23 گرم چربی (12 گرم چربی اشباع)، 134 میلی گرم کلسترول، 868 میلی گرم سدیم، 32 گرم کربوهیدرات، 2 گرم فیبر، 45 گرم پروتئین.\n" +
                    "به\u200Cجای گوشت بوقلمون دودی می\u200Cتوانید از ژامبون بوقلمون استفاده کنید.\n" +
                    "مواد لازم:\n" +
                    "گوشت بوقلمون دودی : 3 پیمانه\n" +
                    "شیر : ¼1 پیمانه\n" +
                    "آب مرغ : ¼1 پیمانه\n" +
                    "پنیر پارمزان رنده شده : ¼1 پیمانه\n" +
                    "جعفری تازه خرد شده : ¼ پیمانه\n" +
                    "ژامبون گوشت : 5 ورقه\n" +
                    "نان تست : 4 تکه\n" +
                    "گوجه\u200Cفرنگی : 1 عدد\n" +
                    "پیاز : 1 عدد\n" +
                    "آرد : 2 قاشق غذاخوری\n" +
                    "نمک : به مقدار لازم\n" +
                    "فلفل : به مقدار لازم\n" +
                    "سس خردل : به مقدار دلخواه\n" +
                    "کره : به مقدار دلخواه\n" +
                    "\n" +
                    "طرز تهیه:\n" +
                    "پیازها را ریز خرد کنید.\n" +
                    "گوشت بوقلمون دودی یا ژامبون بوقلمون را به صورت رشته\u200Cای خرد کنید.\n" +
                    "نان را در تستر یا تابه، تست کنید.\n" +
                    "اجاق را روشن کنید و ژامبون را در تابه ای بزرگ و روی حرارت متوسط برای 01 دقیقه تفت دهید تا برشته شود.\n" +
                    "آن را به بشقابی منتقل کنید.\n" +
                    "پیازها را به تابه اضافه کنید و آنها را برای 3 دقیقه تفت دهید تا نرم شوند.\n" +
                    "آرد را افزوده و برای 1 دقیقه دیگر هم بزنید. شعله را تا حد متوسط زیاد کنید، شیر و آب گوشت یا مرغ را بیافزایید و در حالی که آن را هم می  زنید اجازه دهید تا به جوش بیاید.\n" +
                    "شعله را کم کنید و همان طور که مواد را هم می زنید، اجازه دهید برای 6 دقیقه بجوشند تا کمی غلیظ شوند.\n" +
                    "آن را از روی حرارت بردارید و 1 پیمانه پنیر را با مواد مخلوط کنید. به مواد نمک و فلفل بزنید.\n" +
                    "نان ها را روی سینی فر بچینید. روی هر کدام مقداری سس خردل بمالید، سپس مقداری از سس پنیری و در نهایت تکه های گوجه فرنگی را روی نان قرار دهید.\n" +
                    "گوشت بوقلمون را با باقی سس پنیری در تابه تفت دهید. بوقلمون را به طور برابر بین نان تست ها تقسیم کنید و روی آنها ¼ باقی مانده پنیر را بپاشید. آن را برای 2 دقیقه گریل کنید تا پنیر روی آن طلایی شود.\n" +
                    "ژامبون ها را روی ساندویچ ها ریخته و روی آن هم جعفری بپاشید.\n",






            "مواد لازم:\n" +
                    "روغن زیتون 4 قاشق غذاخوری\n" +
                    " پیاز (خرد شده)      1 عدد بزرگ\n" +
                    " فلفل دلمه ای (از رنگ های مختلف - خرد شده)     2 تا 4 عدد\n" +
                    "سیر (خرد شده)       2 حبه بزرگ\n" +
                    "پودر فلفل قرمز       1 قاشق چایخوری\n" +
                    "گوشت بوقلمون (بدون پوست و استخوان-ران یا سینه-تکه تکه شده)         900 گرم\n" +
                    "قارچ (خرد شده)     110 گرم\n" +
                    "گوجه فرنگی (نرم و آبدار) 400 گرم\n" +
                    "آبلیمو 1 قاشق غذاخوری\n" +
                    "رزماری ( تازه و خرد شده) 1 قاشق چایخوری\n" +
                    "فلفل سیاه   به میزان دلخواه\n" +
                    "نمک  به میزان دلخواه\n" +
                    "نشاسته ذرت         2 قاشق چایخوری\n" +
                    "ماست پر چرب      1 فنجان\n" +
                    "\n" +
                    "طرز تهیه تاس کباب بوقلمون با قارچ و فلفل :\n" +
                    "داخل یک ماهیتابه ی بزرگ 2 قاشق غذاخوری روغن زیتون را با حرارت زیاد گرم کنید. پیاز و فلفل ها رو اضافه کنید و تا وقتی که نرم می شوند و کمی سرخ می شوند آن ها را داخل ماهیتابه تفت بدهید. فلفل قرمز و سیر را اضافه کنید و 30 ثانیه کل مواد را در ماهیتابه تقت بدهید، تا وقتی که بوی سیر رو احساس کنید. فلفل، پیاز و سیرها را از ماهیتابه بیرون بیاورید و در یک ظرف دیگر قرار بدهید.\n" +
                    "دو قاشق غذاخوری روغن زیتون باقیمانده را هم با حرارت زیاد داغ کنید. قارچ ها و گوشت بوقلمون را به ماهیتابه اضافه کنید. با حرارت زیاد به مدت 4 الی 5 دقیقه آن ها را داخل ماهیتابه تفت بدهید تا وقتی که گوشت و قارچ ها شروع به سرخ شدن می کنند. شعله را در حالت ملایم قرار بدهید و مخلوط فلفل، پیاز و سیری که در ظرف دیگه ای بودند را دوباره به ماهیتابه برگردانید و خوب آن ها را میکس کنید.\n" +
                    "  \n" +
                    "گوجه فرنگی ها رو له کنید و آن ها با آبشان به ماهیتابه اضافه کنید، آبلیمو، رزماری و فلفل سیاه را هم به همین صورت اضافه می کنید. مواد رو خوب با هم مخلوط کنید، شعله رو یک کم دیگه کم کنید، در ماهیتابه را بگذارید و اجازه بدهید حدوداً 15 الی 20 دقیقه بپزند.\n" +
                    "نشاسته ی ذرت را در ماست اضافه کرده و با هم مخلوط کنید و آنها را به ماهیتابه اضافه کنید. با حرارت کم بگذارید بپزند (اجازه ندهید بجوشند)، هر چند دقیقه مواد داخل ماهیتابه رو به هم بزنید، وقتی که تاس کبابمان یکم غلیظ شد یعنی آماده است!\n" +
                    "این تاس کباب خوشمزه را می توانید با برنج یا پوره ی سیب زمینی میل کنید.\n",


    };


    public Amozesh() {
        setData();
    }

    private void setData() {

        for (int i = 0; i < title.length; i++) {
            AmozeshModel model = new AmozeshModel();
            model.setTitle(title[i]);
            model.setDescription(description[i]);
            model.setImage(image[i]);
            model.setText1(text[i]);
            data.add(model);
        }
    }

    public ArrayList<AmozeshModel> getData(){
        return data;
    }

}
