package ir.loper.neginsabz.Data;


import java.util.ArrayList;

import ir.loper.neginsabz.Model.MazayaModel;
import ir.loper.neginsabz.R;


public class Mazaya {

    ArrayList<MazayaModel> data = new ArrayList<>();

    String[] title =new String[]{
            "درباره بوقلمون ها بیشتر بدانیم",

            " بخش اول",

            " بخش دوم",

            " بخش سوم"

    };

    String[] description =new String[]{

            "بیشتر بدانیم",
            "بخش اول",
            "بخش دوم",
            "بخش سوم"

    };

    int[] image =new int[]{
            R.drawable.boghalamon1,
            R.drawable.boghalamon2,
            R.drawable.boghalamon3,
            R.drawable.boghalamon4
    };

    String[] text =new String[]{

            "در قسمت اول ،اطلاعاتی درباره ی اسم جنسیت های مختلف این پرنده ، مدت زمان جوجه کشی و ... آشنا شدیم ،حالا وقت اون رسیده که اطلاعات جدیدتری رو همراه با هم مطالعه کنیم.\n" +
                    "\n" +
                    "در حالت صنعتی بوقلمونها عموماٌ به وسیله جیره\u200Cای مرکب از: ذرت، کنجاله سویا، ویتامینها و مینرالهای مکمل تغذیه می\u200Cشوند. البته توجه داشته باشید این بالانس جیره علاوه بر کیفیت باید متناسب با قیمت اقتصادی غذا باشد به طوریکه خوراک بدست آمده دارای ارزانترین قیمت و با کیفیتی مطلوب باشد که در این قسمت است که اهمیت وجود مهندسین دامپروری که با علم جیره نویسی و همچنین قیمتهای روز بازار آشنائی داشته باشند مشخص می گردد .\n" +
                    "\n" +
                    " جوجه بوقلمون همانند سایر طیور در 24 ساعت اول رندگی خویش احتیاجی به خوردن و آشامیدن ندارد زیرا وجود کیسه زرده این احتیاجات را برای مدتی تامین می\u200Cکند. اما پس از سپری شدن این مدت نیاز به غذای کافی خواهد داشت. شایان ذکر است که برخلاف باورهای موجود در خصوص تغذیه سایر طیور صنعتی مانند مرغ، جوجه بوقلمون ها را می توان از همان روز اول تغذیه نمود که حتی این مورد بوسیله برخی از متخصصین امری واجب شمرده می شود. \n" +
                    "\n" +
                    "در گذشته برای جلوگیری از بیماری رایج چسبندگی مقعد در بوقلمون ها، به جوجه ها گردو خورانده می شد که امروزه به دلیل اصلاح نژادهای صورت گرفته و عدم وجود این مشکل در بوقلمون های صنعتی فعلی، از این روش استفاده نمی گردد. \n" +
                    "\n",




            "در این سری از درباره بوقلمون ها بیشتر بدانیم تصمیم داریم بریم سراغ دانستنی های جالبی درباره خواص گوشت این پرنده ، که در ادامه با هم مطالعه می کنیم.\n" +
                    "\n" +
                    "بهتر است در وعده های غذایی تان از گوشت بوقلمون نیز استفاده کنید این ماده غذایی حاوی خواص بیشماری برای افزایش سلامتی شماست از اثرات مفید گوشت بوقلمون بر بدن می توانیم به جلوگیری از سرطان،بهبود کم\u200Fخوابی،ایجاد آرامش و سرحالی و افزایش هورمون تستوسترون اشاره کنیم .\n" +
                    "\n" +
                    " بوقلمون دارای آهن، روی، فسفر، پتاسیم و ویتامین\u200Cهای B است. جالب اینجاست که به\u200Cدلیل بافت خاصی که گوشت بوقلمون دارد برخلاف برخی پروتئین\u200Cها هنگام طبخ حجم خود را از دست نمی\u200Cدهد و کم\u200Cترین میزان چربی اشباع و کلسترول را در مقایسه با گوشت قرمز دارد؛ درعین\u200Cحال منبع غنی از انواع ویتامین B و ویتامین A است.\n" +
                    "\n" +
                    "مصرف گوشت بوقلمون به\u200Cویژه در فصل سرما برای کودکان و سالمندان بسیار مناسب است. به دلیل اسیدآمینه موجود در گوشت بوقلمون این ماده غذایی می\u200Cتواند از تجمع سرب و جیوه در بدن جلوگیری و به عملکرد کبد برای دفع سموم بدن کمک کند. بوقلمون کلسترول بد خون را کاهش می\u200F\u200Fدهد، آرامش و سرحالی ایجاد می\u200Fکند، از سرطان جلوگیری می\u200Fکند، ترشح هورمون تستوسترون را افزایش می\u200Fدهد و سیستم ایمنی را تقویت می\u200Fکند. 150 گرم گوشت بوقلمون حدود نیمی از اسیدفولیک موردنیاز روزانه را تأمین می\u200Cکند؛ همچنین منبع خوبی از پروتئین، سلنیوم، روی و پتاسیم و ویتامین\u200Fهای B1، B3، B6 و B12 و اسیدآمینه تریپتوفان است. گوشت بوقلمون بدون پوست، به\u200Cطور طبیعی چربی کمی دارد که معادل یک گرم چربی در هر 30 گرم گوشت است؛ لذا کسانی که دارای رژیم غذایی کم\u200Cچربی هستند، می\u200Fتوانند از آن استفاده کنند. گوشت سفید و بدون پوست بوقلمون، یک ماده غذایی با پروتئین بالا و چربی کم است. کسانی که باید غذاهای کم\u200Cچرب بخورند، می\u200Fتوانند از قسمت سفید گوشت بوقلمون استفاده کنند.",





            "در بخش اول این مقاله، به اطلاعات کلی دربارۀ گوشت این پرنده اشاره شد اما در بخش دوم تصمیم داریم اثرات مثبتی که نوش جان کردن گوشت این پرنده ، بر بدنمون میزاره رو برای شما تشریح کنیم.\n" +
                    "\n" +
                    "1-کاهش کلسترول بد خون\n" +
                    "\n" +
                    "مصرف گوشت بوقلمون به دلیل کلسترول بالای این گوشت (بین دوازده تا چهارده درصد) برای افراد با کلسترول بالا مضر است و افراد دارای کلسترول بالا می\u200Cتوانند از قسمت\u200Cهای روشن\u200Cتر گوشت بوقلمون که بدون پوست بوده و دارای چربی، چربی اشباع و کلسترول کمتری است استفاده کنند. اگر سینه مرغ و بوقلمون را مقایسه کنیم، میزان پروتئین موجود در گوشت مرغ بیشتر بوده و ازنظر میزان کلسترول، گوشت مرغ بدون پوست، کلسترول بسیار پایین\u200Cتری نسبت به گوشت بوقلمون دارد؛ ازاین\u200Cرو، با در نظر گرفتن این تفاوت، استفاده از گوشت مرغ برای بیماران دارای کلسترول بالا توصیه می\u200Cشود. این نکته درباره گوشت بوقلمون حائز اهمیت است که قسمت تیره گوشت بوقلمون چربی بیشتری نسبت به قسمت گوشت سفید آن دارد؛ بنابراین بهتر است افراد دارای فشارخون و چربی بالا از قسمت گوشت سینه آن استفاده کنند. قسمت روشن\u200Fتر گوشت بوقلمون که بدون پوست باشد، دارای چربی، چربی اشباع و کلسترول کمتری از گوشت مرغ و گاو است.\n" +
                    "\n" +
                    "2_جلوگیری از سرطان\n" +
                    "\n" +
                    "اسیدآمینه تریپتوفان برای فعالیت سلول\u200Fهای T لازم است. سلول\u200Fهای T یک نوع از سلول\u200Fهای سیستم ایمنی بدن هستند که سلول\u200Fهای سرطانی را از بین می\u200Fبرند. در فقدان تریپتوفان، سلول\u200Cهای T فعال می\u200Fمیرند.\n" +
                    "\n" +
                    "3_افزایش هورمون تستوسترون\n" +
                    "\n" +
                    "پروتئین موجود در گوشت بوقلمونی که به\u200Cطور طبیعی (بدون استفاده از مواد شیمیایی و هورمونی) پرورش داده\u200Cشده است، میزان هورمون تستوسترون را در بدن آقایان، در حد مطلوب نگه می\u200Fدارد؛ ولی هورمون\u200Fهایی که در پرورش بوقلمون\u200Fهای صنعتی استفاده می\u200Fشوند، تولید هورمون استروژن (هورمون زنانه) را افزایش و هورمون تستوسترون را کاهش می\u200Cدهند. کمبود پروتئین در برنامه غذایی مردان مسن، منجر به افزایش گلوبولین باند شده با هورمون جنسی و کاهش فعالیت هورمون تستوسترون می\u200Fشود. کاهش اثر تستوسترون باعث کاهش عملکرد جنسی و توده عضلانی و گلبول\u200Fهای قرمز خون و پوکی استخوان می\u200Fشود.\n" +
                    "\n" +
                    "4-ایجاد آرامش و سرحالی\n" +
                    "\n" +
                    "ناقلین عصبی از اسیدهای آمینه تشکیل می\u200Fشوند و ناقل عصبی به نام «سروتونین» از اسیدآمینه تریپتوفان تشکیل\u200Cشده است. سروتونین باعث سرحالی و آرامش در بدن می\u200Fشود؛ لذا مصرف غذاهایی مثل بوقلمون باعث سرحالی می\u200Fشود.\n" +
                    "\n" +
                    "5-بهبود کم \u200Fخوابی\n" +
                    "\n" +
                    "اسیدآمینه تریپتوفان نقش مهمی در خوابیدن دارد و باعث بهبود خواب در مبتلایان به بی\u200Fخوابی مزمن می\u200Fشود.",




            "این مقاله مکمل و تکمیل کننده اطلاعات دو بخش قبل از این سری از دانستنی هاست و تصمیم داریم ضررها و معایب گوشت این پرنده رو با هم مطالعه کنیم و اطلاعاتمون در این حوزه جامع تر و کامل تر بشه بنابراین با هم به مطالعۀ ادامه این مقاله میپردازیم.\n" +
                    "\n" +
                    " گوشت بوقلمون دارای مقدار کمی اگزالات است؛ لذا بیماران مبتلابه سنگ کلیه اگزالاتی، خیلی کم باید آن را بخورند.\n" +
                    "\n" +
                    " تقریباً تمامی چربی بوقلمون در پوست آن موجود است؛ همچنین گوشت تیره\u200Cرنگ آن چربی بیشتری از گوشت روشن\u200Fتر (سفید) آن دارد؛ لذا قبل از پختن گوشت بوقلمون، تمامی پوست آن را جدا کنید؛ درضمن افراد مبتلابه چربی خون بالا بهتر است از گوشت روشن\u200Fتر آن استفاده کنند. گوشت بوقلمون دارای اسیدآمینه پورین است؛ بنابراین مبتلایان به نقرس باید آن را به میزان خیلی کم \u200Cمصرف کنند.\n" +
                    "\n" +
                    " بوقلمون\u200Fهایی که به\u200Cطور طبیعی و ارگانیک پرورش داده می\u200Fشوند، هیچ نوع هورمون و آنتی\u200Cبیوتیکی در بدن خود ندارند.\n" +
                    "\n" +
                    " پیشگیری و درمان کم\u200Cخونی به دلیل وجود هموگلوبین زیاد در ران بوقلمون مصرف آن برای افرادی که کمبود آهن دارند بسیار مفید است و توصیه می\u200Cشود.\n" +
                    "\n" +
                    "مصرف گوشت بوقلمون و تاثیر آن بر دیابت و کبد چرب\n" +
                    "\n" +
                    " گوشت بوقلمون به دلیل دارا بودن چربی\u200Cهای اشباع\u200Cشده کم، پروتئین بالا و درصد کربوهیدرات پایین برای بیماران مفید است؛ همچنین به علت درصد بسیار کم \u200Cچربی\u200Cهای اشباع\u200Cشده در این گوشت، مصرف آن برای افرادی که دارای کبد چرب هستند مناسب است."







    };


    public Mazaya() {
        setData();
    }

    private void setData() {

        for (int i = 0; i < title.length; i++) {
            MazayaModel model = new MazayaModel();
            model.setTitle(title[i]);
            model.setDescription(description[i]);
            model.setImage(image[i]);
            model.setText1(text[i]);
            data.add(model);
        }
    }

    public ArrayList<MazayaModel> getData(){
        return data;
    }

}
